app/Controllers/MapController.php

    public function index()
    {
        $locationModel = new LocationModel();
        $locations = $locationModel->findAll();
---
SELECT *
FROM `locations`